jmeter/aggregate.csv
Label,# Samples,Average,Median,90% Line,95% Line,99% Line,Min,Max,Error %,Throughput,Received KB/sec,Sent KB/sec
GET /naive,5000,6131,6221,6637,6834,7582,495,12587,0.000%,7.99170,65.59,9.95
GET /cached,5000,3,3,4,4,13,2,650,0.000%,492.07755,4038.36,613.17
GET /materialized,5000,6,6,8,8,34,5,55,0.000%,472.05438,3874.03,590.99
GET /naive (DDoS),1025,38523,38810,60003,60381,66486,1844,69018,56.488%,8.75672,47.43,4.74
GET /cached (DDoS),77271,372,280,375,429,1170,2,59326,0.144%,1280.10536,10496.40,1592.84
TOTAL,93296,1061,277,443,6093,20006,2,69018,0.740%,99.68650,814.46,123.33